Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4C8C_1.xml
<?xml version="1.0" encoding="UTF-8"?><!-- ============================================================================ --><!--                  Atmel Microcontroller Software Support                      --><!--                       SAM Software Package License                           --><!-- ============================================================================ --><!-- Copyright (c) 2015, Atmel Corporation                                        --><!--                                                                              --><!-- All rights reserved.                                                         --><!--                                                                              --><!-- Redistribution and use in source and binary forms, with or without           --><!-- modification, are permitted provided that the following condition is met:    --><!--                                                                              --><!-- - Redistributions of source code must retain the above copyright notice,     --><!-- this list of conditions and the disclaimer below.                            --><!--                                                                              --><!-- Atmel's name may not be used to endorse or promote products derived from     --><!-- this software without specific prior written permission.                     --><!--                                                                              --><!-- DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   --><!-- IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF --><!-- MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   --><!-- DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      --><!-- INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT --><!-- LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  --><!-- OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    --><!-- LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         --><!-- NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, --><!-- EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           --><!-- ============================================================================ --><avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.3" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <variants>
    <variant ordercode="ATSAM4C8C-AU" package="LQFP100" speedmax="120" tempmax="+85" tempmin="-40" vccmax="3.6" vccmin="1.62"/>
  </variants>
  <devices>
    <device architecture="CORTEX-M4" family="SAM4" name="ATSAM4C8C_1" series="SAM4C">
      <address-spaces>
        <address-space id="base" name="base" endianness="little" size="0x100000000" start="0">
          <memory-segment name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io"/>
          <memory-segment name="IFLASH" start="0x01000000" size="0x00080000" type="flash" pagesize="512" mirror-mask="0x10000000"/>
          <memory-segment name="IROM" start="0x02000000" size="0x01000000" type="rom"/>
          <memory-segment name="IRAM1" start="0x20080000" size="0x00004000" type="ram"/>
          <memory-segment name="IRAM2" start="0x20100000" size="0x00002000" type="ram"/>
          <memory-segment name="EBI_CS0" start="0x60000000" size="0x01000000" type="other" mirror-mask="0x10000000"/>
          <memory-segment name="EBI_CS1" start="0x61000000" size="0x01000000" type="other" mirror-mask="0x10000000"/>
          <memory-segment name="EBI_CS2" start="0x62000000" size="0x01000000" type="other" mirror-mask="0x10000000"/>
          <memory-segment name="EBI_CS3" start="0x63000000" size="0x01000000" type="other" mirror-mask="0x10000000"/>
        </address-space>
        <address-space id="fuses" name="fuses" endianness="little" size="1" start="0"/>
        <address-space id="lockbits" name="lockbits" endianness="little" size="0x8" start="0"/>
      </address-spaces>
      <peripherals>
        <module name="ADC" version="11250A">
          <instance name="ADC">
            <register-group address-space="base" name="ADC" name-in-module="ADC" offset="0x40038000"/>
            <signals>
              <signal pad="PB23" function="A" group="ADTRG"/>
              <signal pad="PA4" function="X1" group="COM" index="4"/>
              <signal pad="PA4" function="X1" group="AD" index="1"/>
              <signal pad="PA5" function="X1" group="COM" index="5"/>
              <signal pad="PA5" function="X1" group="AD" index="2"/>
              <signal pad="PA12" function="X1" group="SEG" index="6"/>
              <signal pad="PA12" function="X1" group="AD" index="0"/>
              <signal pad="PB13" function="X1" group="SEG" index="31"/>
              <signal pad="PB13" function="X1" group="AD" index="3"/>
              <signal pad="PB23" function="X1" group="SEG" index="41"/>
              <signal pad="PB23" function="X1" group="AD" index="4"/>
              <signal pad="PB31" function="X1" group="SEG" index="49"/>
              <signal pad="PB31" function="X1" group="AD" index="5"/>
            </signals>
          </instance>
        </module>
        <module name="AES" version="6149L">
          <instance name="AES">
            <register-group address-space="base" name="AES" name-in-module="AES" offset="0x40000000"/>
          </instance>
        </module>
        <module name="CHIPID" version="6417R">
          <instance name="CHIPID">
            <register-group address-space="base" name="CHIPID" name-in-module="CHIPID" offset="0x400E0740"/>
          </instance>
        </module>
        <module name="CMCC" version="11108C">
          <instance name="CMCC0">
            <register-group address-space="base" name="CMCC0" name-in-module="CMCC" offset="0x4007C000"/>
          </instance>
          <instance name="CMCC1">
            <register-group address-space="base" name="CMCC1" name-in-module="CMCC" offset="0x48018000"/>
